app/services/binance_service.rb

  def self.find_or_create_cryptocurrency(name, symbol, price, rsi, volume_24h = 0)
    # Market Cap berechnen basierend auf geschätzter Coin Supply
    estimated_supply = estimate_coin_supply(name.upcase)
    market_cap_usd = price * estimated_supply

    # Verwende das vollständige Trading-Pair als Symbol
    crypto = Cryptocurrency.find_or_initialize_by(symbol: symbol.upcase)

    crypto.assign_attributes(
      name: format_crypto_name(name),
      symbol: symbol.upcase, # Vollständiges Trading-Pair (z.B. BTCUSDC)
      current_price: price,
      market_cap: market_cap_usd,
      rsi: rsi,
      volume_24h: volume_24h * price, # Volumen in USD
      market_cap_rank: crypto.persisted? ? crypto.market_cap_rank : Cryptocurrency.count + 1,
      updated_at: Time.current
    )

    crypto.save!
---
SELECT "cryptocurrencies".* FROM "cryptocurrencies" WHERE "cryptocurrencies"."symbol" = ? LIMIT ?  [["symbol", "BTCUSDC"], ["LIMIT", 1]]
SELECT COUNT(*) FROM "cryptocurrencies"
UPDATE "cryptocurrencies" SET "current_price" = ?, "market_cap" = ?, "volume_24h" = ?, "rsi" = ?, "updated_at" = ? WHERE "cryptocurrencies"."id" = ?  [["current_price", 108839.97], ["market_cap", 2144147409000], ["volume_24h", 477956416], ["rsi", 43.97], ["updated_at", "2025-05-28 11:40:10.169859"], ["id", 580]]