app/services/freqtrade_api_service.rb

SELECT "cryptocurrencies".* FROM "cryptocurrencies" WHERE "cryptocurrencies"."symbol" = ? LIMIT ?  [["symbol", "BTC"], ["LIMIT", 1]]
---
  def update_or_create_cryptocurrency(coin_data)
    crypto = Cryptocurrency.find_or_initialize_by(symbol: coin_data['symbol']&.upcase)