lib/tasks/binance.rake

SELECT COUNT(*) FROM "cryptocurrencies"
---
  task fetch_top_50: :environment do
    puts "=" * 50
    puts "BINANCE TOP 50 CRYPTOCURRENCY DATA FETCHER (USDC PAIRS)"
    puts "=" * 50

    start_time = Time.current

    begin
      # Verwende die neue get_top_usdc_pairs Methode
      top_symbols = BinanceService.get_top_usdc_pairs

      BinanceService.fetch_specific_cryptos(top_symbols)

      end_time = Time.current
      duration = (end_time - start_time).round(2)

      puts "=" * 50
      puts "SUMMARY:"
      puts "Total cryptocurrencies in database: #{Cryptocurrency.count}"

SELECT COUNT(*) FROM "cryptocurrencies"
DELETE FROM "cryptocurrencies" WHERE "cryptocurrencies"."id" = ?  [["id", 525]]
---
  task clear_data: :environment do
    puts "Clearing all cryptocurrency data..."
    count = Cryptocurrency.count
    Cryptocurrency.destroy_all