app/controllers/cryptocurrencies_controller.rb

  def index
    @cryptocurrencies = Cryptocurrency.top_50
    @last_update = Cryptocurrency.maximum(:updated_at)

    # Wenn keine Daten vorhanden sind, versuche sie zu laden
    if @cryptocurrencies.empty?
---
SELECT "cryptocurrencies".* FROM "cryptocurrencies"
SELECT MAX("cryptocurrencies"."updated_at") FROM "cryptocurrencies"
SELECT 1 AS one FROM "cryptocurrencies" LIMIT ?  [["LIMIT", 1]]

  def show
    @cryptocurrency = Cryptocurrency.find(params[:id])
---
SELECT "cryptocurrencies".* FROM "cryptocurrencies" WHERE "cryptocurrencies"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def set_cryptocurrency
    @cryptocurrency = Cryptocurrency.find(params[:id])
---
SELECT "cryptocurrencies".* FROM "cryptocurrencies" WHERE "cryptocurrencies"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]