app/views/cryptocurrencies/index.html.erb

SELECT "cryptocurrencies".* FROM "cryptocurrencies" WHERE "cryptocurrencies"."symbol" = ? LIMIT ?  [["symbol", "NEAR"], ["LIMIT", 1]]
SELECT MAX("cryptocurrencies"."updated_at") FROM "cryptocurrencies"
---
                 console.log("🕯️ Candle-Update erhalten:", messageData);
                 console.log("🕯️ Candle-Update Details:", {
                   symbol: messageData.symbol,
                   cryptoId: messageData.cryptocurrency_id,
                   candlesCount: messageData.candles ? messageData.candles.length : 0,
                   candles: messageData.candles
                 });

INSERT INTO "cryptocurrencies" ("symbol", "name", "current_price", "market_cap", "market_cap_rank", "price_change_percentage_24h", "volume_24h", "rsi", "last_updated", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
            if (typeof App !== 'undefined' && App.cable) {
              const channel = App.cable.subscriptions.create("PricesChannel", {
                received(data) {
                  if (data.type === 'price') {
                    const container = document.querySelector(`[data-crypto-id="${data.cryptocurrency_id}"]`);
                    if (container) {
                      // Update Mini-Candlestick
                      const miniCanvas = container.querySelector('.mini-candlestick');
                      if (miniCanvas) {
                        updateMiniCandlestick(miniCanvas, data.price, data.cryptocurrency_id);
                      }

                      // Update 1h Kerzen
                      const current1hCanvas = container.querySelector('.current-1h-candles');
                      if (current1hCanvas) {
                        updateCurrent1hCandles(current1hCanvas, data.price, data.cryptocurrency_id);
                      }
                    }
                  }
                }
              });